/***********************************************************************
 * $Id$
 * Copyright (c) 1997 by Fort Gunnison, Inc.
 * 
 * kgAlert.h: アラート表示用のユーティリティ
 *
 * Author:		Shin'ya Koga (koga@ftgun.co.jp)
 * Created:		Dec. 16, 1997
 * Last update: Dec. 24, 1997
 ************************************************************************
*/

#ifndef _KG_ALERT_H_
#define _KG_ALERT_H_

/*      #########################################################       */
/*      #               I N C L U D E   F I L E S               #       */
/*      #########################################################       */

/*      #########################################################       */
/*      #               T Y P E   D E F I N E S                 #       */
/*      #########################################################       */

/*      #########################################################       */
/*      #             P U B L I C   F U N C T I O N S           #       */
/*      #########################################################       */

/*
 * アラートパネルの表示
 */
extern void	KGAlert (const char mesg[]);
extern bool	KGConfirm (const char mesg[]);


#endif  /* _KG_ALERT_H_ */

/*
 * End of File
 */
